Cats/app/controllers/cats_controller.rb

    def update
        @cat = Cat.find(params[:id])

        if @cat.update(cat_params)
---
SELECT  "cats".* FROM "cats" WHERE "cats"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "cats" SET "color" = $1, "description" = $2, "updated_at" = $3 WHERE "cats"."id" = $4  [["color", "black"], ["description", "cant wait to be king.. run away"], ["updated_at", "2019-04-30 21:03:49.807655"], ["id", 2]]

    def create
        @cat = Cat.new(cat_params)
        if @cat.save
---
INSERT INTO "cats" ("birth_date", "color", "name", "description", "sex", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"